Repository: ShahzodSalimsakov/newtook
Catalog: lib/l10n/app_*.arb
Languages: uz

source: Scan
uz: Skanerlang

# scan_brand_qr
source: Scan Brand Code
uz: Brand QR-kodni skanerlang

# app_clients_intro_title
source: Connect to the service
uz: Xizmatga ulaning

# app_clients_intro_description
source: Scan the brand code to connect to the service. If you don't have a code, ask the delivery manager.
uz: Brand QR-kodini skanerlang, xizmatga ulaning. Agar sizda QR-kod yo'q bo'lsa, yetkazib beruvchining menejeriga so'rang.

# error_label
source: Error
uz: Xato

source: This service is not valid
uz: Bu xizmat haqiqiy emas

source: Profile
uz: Profil

source: Orders
uz: Buyurtmalar

source: Settings
uz: Sozlamalar

# typed_phone_incorrect
source: The phone number is incorrect
uz: Telefon raqami noto'g'ri

# phone_field_label
source: Phone number
uz: Telefon raqami

source: Send code
uz: Kodni yuborish

# sigin_in
source: Sign in
uz: Kirish

# otpCodeError
source: Invalid code
uz: Noto'g'ri kod

# choose_lang
source: Choose language
uz: Tilni tanlang

# location_is_disabled_error
source: Enable location
uz: Joylashuvni yoqish

source: Choose brand
uz: Brendni tanlang

source: Add
uz: Qo'shish

# order_list_empty
source: Order list is empty
uz: Buyurtma ro'yxati bo'sh

# order_tab_current
source: Current
uz: Joriy

source: You are not courier
uz: Siz kuryer emassiz

# error_work_schedule_offline_title
source: You did not turn on the work mode
uz: Ish rejimini yoqishni bosishingiz kerak

# notice_torn_on_work_schedule_subtitle
source: Turn on the work mode in the upper right corner to accept orders
uz: Buyurtmalarni qabul qilish uchun yuqoridagi ish rejimini yoqishni bosing

# logout_btn
source: Logout
uz: Chiqish

# order_card_comments
source: Comments
uz: Izohlar

# order_card_items
source: Order items
uz: Buyurtma tarkibi

# customer_orders_type_comment
source: Write a comment
uz: Izoh yozing

# customer_name
source: Name
uz: Ism

source: Address
uz: Manzil

# customer_phone
source: Phone
uz: Telefon

# pre_distance_label
source: Approximate distance
uz: Tayyorlanadigan masofa

# order_total_price
source: Total price
uz: Umumiy narx

source: Delivery price
uz: Yetkazib berish narxi

# order_status_label
source: Order status
uz: Buyurtma holati

# order_tab_waiting
source: Waiting
uz: Kutilmoqda

# order_card_btn_accept
source: Accept
uz: Qabul qilish

source: Call customer
uz: Mijozga qo'ng'iroq

# must_turn_on_location
source: You must turn on location
uz: Siz joylashuvni yoqishingiz kerak

# permission_for_location_denied
source: You have not allowed location
uz: Sizning joylashuvga ruxsat bermagansiz

# wallet_label
source: Wallet
uz: Hisob

# wallet_balance_label
source: Balance
uz: Hisob balansi

# currency_label
source: sum
uz: So'm

# orderStatToday
source: Today
uz: Bugun

# orderStatWeek
source: Week
uz: Hafta

# orderStatMonth
source: Month
uz: Oy

# orderStatYesterday
source: Yesterday
uz: Kecha

# successOrderLabel
source: Success
uz: Yetkazildi

# failedOrderLabel
source: Failed
uz: Bekor qilindi

# orderStatTotalPrice
source: Total price
uz: Umumiy narx

# orderApprovedSuccessfully
source: Order is approved
uz: Buyurtma qabul qilindi

# cancelOrderModalLabel
source: Cancel order
uz: Buyurtmani bekor qilish

# cancelOrderModalCause
source: Type the cancel reason
uz: Bekor qilish sababini kiriting

# cancelOrderModalSentSMSLabel
source: Sent sms to the customer
uz: Mijozga sms yuvordim

# courierScoreLabel
source: Rating
uz: Reyting

# buildOrderRouteButton
source: Build route
uz: Yo'nalishni tuzish

# commentFieldLabel
source: Leave a comment
uz: Izoh qoldiring

source: Choose image from gallery
uz: Gallereyadan tanlang

# chooseImageFromCamery
source: Take a photo on camera
uz: Kamera bilan suratga oling

# imageAttachmentCancelText
source: Cancel
uz: Bekor qilish

# setCancelReasonLabel
source: Specify the reason for the cancellation of the order
uz: Buyurtmani bekor qilish sababini ko'rsating

# settingsCallCenterChatLabel
source: Write to the call center
uz: Qo'ng'iroq markaziga yozing

source: No role set
uz: Rol belgilanmagan

# courierBalanceTabLabel
source: Couriers' balance
uz: Kuryerlar hisobi

# couriersListTabLabel
source: Couriers
uz: Kuryerlar

source: Choose courier for withdraw
uz: Pulini bermoqchi bo'lgan kuryeringizni tanlang

# currentBalanceLabel
source: Current balance
uz: Joriy balans

source: Type withdraw amount
uz: Pul miqdorini kiriting

# withdrawButtonLabel
source: Withdraw
uz: Pulni bermoq

source: Orders history
uz: Buyurtmalar tarixi

source: No orders
uz: Buyurtmalar yo'q

source: Courier name
uz: Kuryer ismi

source: Orders management
uz: Buyurtmalar boshqarish

# order_card_change_courier
source: Change courier
uz: Kuryerni o'zgartirish

# order_card_assign_courier
source: Assign courier
uz: Kuryerni belgilash

# chooseCourierLabel
source: Choose courier
uz: Kuryerni tanlang

# locationDialogLabel
source: Location permissions
uz: Geolokasiyaga ruxsat bering

# locationDialogText
source: To track your physical activity as part of your orders, the Arryt app collects location data even when the app is closed or not in use
uz: Buyurtmalar bo'yicha jismoniy faolligingizni kuzatish uchun Arret ilovasi ilova yopiq yoki ishlatilmaganda ham joylashuv ma'lumotlarini to'playdi

# locationDialogApprove
source: Allow
uz: Ruxsat berish

source: Privacy policy
uz: Maxfiylik siyosati

source: Payment type
uz: To'lov turi
